#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.vpc.data.aws_iam_policy_document.flow_log_cloudwatch_assume_role[0]: Reading...
module.eks.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/eks/eks-cluster/cluster]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0929cc0e68ce17d31]
module.vpc.data.aws_iam_policy_document.vpc_flow_log_cloudwatch[0]: Reading...
module.eks.data.aws_caller_identity.current: Reading...
module.eks.module.kms.data.aws_partition.current: Reading...
data.aws_partition.current: Reading...
module.eks.data.aws_partition.current: Reading...
data.aws_partition.current: Read complete after 0s [id=aws]
module.vpc.data.aws_iam_policy_document.vpc_flow_log_cloudwatch[0]: Read complete after 0s [id=2053943846]
module.eks.data.aws_partition.current: Read complete after 0s [id=aws]
module.vpc.data.aws_iam_policy_document.flow_log_cloudwatch_assume_role[0]: Read complete after 0s [id=1021377347]
data.aws_iam_policy_document.cluster_autoscaler: Reading...
module.eks.module.kms.data.aws_caller_identity.current: Reading...
module.eks.module.kms.data.aws_partition.current: Read complete after 0s [id=aws]
data.aws_iam_policy_document.ebs_csi: Reading...
data.aws_iam_policy_document.cluster_autoscaler: Read complete after 0s [id=2501413134]
data.aws_availability_zones.available: Reading...
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Reading...
aws_iam_policy.cluster_autoscaler: Refreshing state... [id=arn:aws:iam::130541009828:policy/cluster-autoscaler20230423030755874100000001]
module.vpc.aws_iam_policy.vpc_flow_log_cloudwatch[0]: Refreshing state... [id=arn:aws:iam::130541009828:policy/vpc-flow-log-to-cloudwatch-20230423023254623400000002]
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2764486067]
module.eks.aws_iam_role.this[0]: Refreshing state... [id=eks-cluster-cluster-20230423030755900400000003]
module.vpc.aws_iam_role.vpc_flow_log_cloudwatch[0]: Refreshing state... [id=vpc-flow-log-role-20230423023254623400000001]
data.aws_iam_policy_document.ebs_csi: Read complete after 0s [id=3589372343]
aws_iam_policy.ebs_csi: Refreshing state... [id=arn:aws:iam::130541009828:policy/AmazonEKS_EBS_CSI_Policy-NG-20230423030755898800000002]
module.eks.data.aws_caller_identity.current: Read complete after 0s [id=130541009828]
module.eks.module.kms.data.aws_caller_identity.current: Read complete after 0s [id=130541009828]
module.eks.data.aws_iam_session_context.current: Reading...
module.eks.data.aws_iam_session_context.current: Read complete after 0s [id=arn:aws:sts::130541009828:assumed-role/github-oidc-terraform-aws-role/GitHub-OIDC-TERRAFORM]
module.eks.module.eks_managed_node_group["eks-cluster-ng"].data.aws_caller_identity.current: Reading...
module.eks.module.eks_managed_node_group["eks-cluster-ng"].data.aws_partition.current: Reading...
module.eks.module.eks_managed_node_group["eks-cluster-ng"].data.aws_partition.current: Read complete after 0s [id=aws]
module.vpc.aws_iam_role_policy_attachment.vpc_flow_log_cloudwatch[0]: Refreshing state... [id=vpc-flow-log-role-20230423023254623400000001-20230423023255276400000003]
module.eks.module.eks_managed_node_group["eks-cluster-ng"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks.module.eks_managed_node_group["eks-cluster-ng"].data.aws_caller_identity.current: Read complete after 0s [id=130541009828]
module.eks.module.eks_managed_node_group["eks-cluster-ng"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2560088296]
module.eks.module.eks_managed_node_group["eks-cluster-ng"].aws_iam_role.this[0]: Refreshing state... [id=eks-cluster-ng-eks-node-group-20230423030756328600000006]
module.eks.module.kms.data.aws_iam_policy_document.this[0]: Reading...
module.eks.aws_iam_role_policy_attachment.this["AmazonEKSClusterPolicy"]: Refreshing state... [id=eks-cluster-cluster-20230423030755900400000003-20230423030756658700000008]
module.eks.aws_iam_role_policy_attachment.this["AmazonEKSVPCResourceController"]: Refreshing state... [id=eks-cluster-cluster-20230423030755900400000003-20230423030756651300000007]
module.eks.module.kms.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=3709360355]
module.eks.module.kms.aws_kms_key.this[0]: Refreshing state... [id=b6bf6eb1-5d6e-41cf-9016-882b4c6ce758]
module.eks.module.eks_managed_node_group["eks-cluster-ng"].aws_iam_role_policy_attachment.additional["additional"]: Refreshing state... [id=eks-cluster-ng-eks-node-group-20230423030756328600000006-2023042303075688730000000d]
module.eks.module.eks_managed_node_group["eks-cluster-ng"].aws_iam_role_policy_attachment.additional["additional3"]: Refreshing state... [id=eks-cluster-ng-eks-node-group-20230423030756328600000006-2023042303075676930000000b]
module.eks.module.eks_managed_node_group["eks-cluster-ng"].aws_iam_role_policy_attachment.additional["additional2"]: Refreshing state... [id=eks-cluster-ng-eks-node-group-20230423030756328600000006-2023042303075673350000000a]
module.eks.module.eks_managed_node_group["eks-cluster-ng"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"]: Refreshing state... [id=eks-cluster-ng-eks-node-group-20230423030756328600000006-2023042303075680140000000c]
module.eks.module.eks_managed_node_group["eks-cluster-ng"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=eks-cluster-ng-eks-node-group-20230423030756328600000006-20230423030756711100000009]
module.eks.module.eks_managed_node_group["eks-cluster-ng"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=eks-cluster-ng-eks-node-group-20230423030756328600000006-2023042303075690890000000e]
data.aws_availability_zones.available: Read complete after 1s [id=ap-southeast-2]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-060649aeec580e1d4]
module.eks.module.kms.aws_kms_alias.this["cluster"]: Refreshing state... [id=alias/eks/eks-cluster]
module.eks.aws_iam_policy.cluster_encryption[0]: Refreshing state... [id=arn:aws:iam::130541009828:policy/eks-cluster-cluster-ClusterEncryption2023042303082964990000000f]
module.eks.aws_iam_role_policy_attachment.cluster_encryption[0]: Refreshing state... [id=eks-cluster-cluster-20230423030755900400000003-20230423030829967600000010]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0ed6e9c5d3d90349e]
module.vpc.aws_route_table.intra[0]: Refreshing state... [id=rtb-0a03bdfbcd6ee86ef]
module.eks.aws_security_group.cluster[0]: Refreshing state... [id=sg-0caabafc7c4a07d8b]
module.vpc.aws_subnet.intra[1]: Refreshing state... [id=subnet-0d4816da66ffcee04]
module.vpc.aws_subnet.intra[0]: Refreshing state... [id=subnet-0c35e9ab3792d7de6]
module.vpc.aws_subnet.intra[2]: Refreshing state... [id=subnet-058a3e4525ffae061]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0dd5bfc474ae2e514]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0a62f3b79b6c72c90]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-076389d57359207f7]
module.eks.aws_security_group.node[0]: Refreshing state... [id=sg-076e3769ba67270ef]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0f45d303909e0083d]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0793a6ed4d5635989]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-0a1689765efa5c40f]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0b23782d468f39e4d]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-05a4b33578d711be8]
module.vpc.aws_cloudwatch_log_group.flow_log[0]: Refreshing state... [id=/aws/vpc-flow-log/vpc-0929cc0e68ce17d31]
module.vpc.aws_route_table_association.intra[2]: Refreshing state... [id=rtbassoc-0b2c564a91cb032fc]
module.vpc.aws_route_table_association.intra[0]: Refreshing state... [id=rtbassoc-0f163f7fe35b7be6d]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0a62f3b79b6c72c901080289494]
module.vpc.aws_route_table_association.intra[1]: Refreshing state... [id=rtbassoc-08e2e8f5301049e8c]
module.eks.aws_security_group_rule.node["ingress_cluster_8443_webhook"]: Refreshing state... [id=sgrule-3355070229]
module.eks.aws_security_group_rule.node["ingress_cluster_443"]: Refreshing state... [id=sgrule-4227766786]
module.eks.aws_security_group_rule.node["ingress_self_all"]: Refreshing state... [id=sgrule-2370772222]
module.eks.aws_security_group_rule.node["ingress_cluster_9443_webhook"]: Refreshing state... [id=sgrule-2740681950]
module.eks.aws_security_group_rule.node["ingress_self_coredns_udp"]: Refreshing state... [id=sgrule-175715812]
module.eks.aws_security_group_rule.node["egress_all"]: Refreshing state... [id=sgrule-2714884883]
module.eks.aws_security_group_rule.node["ingress_cluster_kubelet"]: Refreshing state... [id=sgrule-42285048]
module.eks.aws_security_group_rule.node["ingress_nodes_ephemeral"]: Refreshing state... [id=sgrule-1127307894]
module.eks.aws_security_group_rule.node["ingress_self_coredns_tcp"]: Refreshing state... [id=sgrule-2921764363]
module.eks.aws_security_group_rule.node["ingress_cluster_6443_webhook"]: Refreshing state... [id=sgrule-3567678260]
module.eks.aws_security_group_rule.node["ingress_cluster_4443_webhook"]: Refreshing state... [id=sgrule-501486754]
module.eks.aws_security_group_rule.cluster["ingress_nodes_443"]: Refreshing state... [id=sgrule-1308228930]
module.eks.aws_security_group_rule.cluster["ingress_nodes_ephemeral_ports_tcp"]: Refreshing state... [id=sgrule-4089690716]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0a46a14c785e0e9a0]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0f8d9ca74989b3947]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-028d1dedcdf2b6f68]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-074124f8039c32786]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0c1351d7c1322239c]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-04f710f0d6a69533a]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-025da12f30c61dd61]
module.vpc.aws_flow_log.this[0]: Refreshing state... [id=fl-0a7966750850ca781]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0ed6e9c5d3d90349e1080289494]
module.eks.aws_eks_cluster.this[0]: Refreshing state... [id=eks-cluster]
module.eks.data.tls_certificate.this[0]: Reading...
data.aws_eks_cluster_auth.this: Reading...
data.aws_eks_cluster_auth.this: Read complete after 0s [id=eks-cluster]
module.eks.aws_ec2_tag.cluster_primary_security_group["Environment"]: Refreshing state... [id=sg-020bb9d101dd0700e,Environment]
module.eks.data.aws_eks_addon_version.this["vpc-cni"]: Reading...
module.eks.data.aws_eks_addon_version.this["coredns"]: Reading...
module.eks.data.aws_eks_addon_version.this["aws-ebs-csi-driver"]: Reading...
module.eks.data.aws_eks_addon_version.this["kube-proxy"]: Reading...
module.eks.module.eks_managed_node_group["eks-cluster-ng"].aws_launch_template.this[0]: Refreshing state... [id=lt-0d46a15a0bb57290d]
kubernetes_deployment.example: Refreshing state... [id=default/nginx-deployment]
module.eks.module.eks_managed_node_group["eks-cluster-ng"].aws_eks_node_group.this[0]: Refreshing state... [id=eks-cluster:eks-cluster-ng-20230423031752970100000013]
module.eks.data.aws_eks_addon_version.this["aws-ebs-csi-driver"]: Read complete after 1s [id=aws-ebs-csi-driver]
module.eks.data.aws_eks_addon_version.this["coredns"]: Read complete after 1s [id=coredns]
module.eks.data.aws_eks_addon_version.this["vpc-cni"]: Read complete after 1s [id=vpc-cni]
module.eks.data.tls_certificate.this[0]: Read complete after 1s [id=9c487532a278fce19e21b8856dc33f771a909c70]
module.eks.aws_iam_openid_connect_provider.oidc_provider[0]: Refreshing state... [id=arn:aws:iam::130541009828:oidc-provider/oidc.eks.ap-southeast-2.amazonaws.com/id/0B91026CACFAFCB8D7F2F78F90B8C5F0]
module.eks.data.aws_eks_addon_version.this["kube-proxy"]: Read complete after 1s [id=kube-proxy]
module.eks.aws_eks_addon.this["vpc-cni"]: Refreshing state... [id=eks-cluster:vpc-cni]
module.eks.aws_eks_addon.this["aws-ebs-csi-driver"]: Refreshing state... [id=eks-cluster:aws-ebs-csi-driver]
module.eks.aws_eks_addon.this["coredns"]: Refreshing state... [id=eks-cluster:coredns]
module.eks.aws_eks_addon.this["kube-proxy"]: Refreshing state... [id=eks-cluster:kube-proxy]
module.eks.kubernetes_config_map_v1_data.aws_auth[0]: Refreshing state... [id=kube-system/aws-auth]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # kubernetes_service.example will be created
  + resource "kubernetes_service" "example" {
      + id                     = (known after apply)
      + status                 = (known after apply)
      + wait_for_load_balancer = true

      + metadata {
          + generation       = (known after apply)
          + name             = "my-service"
          + namespace        = "default"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + allocate_load_balancer_node_ports = true
          + cluster_ip                        = (known after apply)
          + cluster_ips                       = (known after apply)
          + external_traffic_policy           = (known after apply)
          + health_check_node_port            = (known after apply)
          + internal_traffic_policy           = (known after apply)
          + ip_families                       = (known after apply)
          + ip_family_policy                  = (known after apply)
          + publish_not_ready_addresses       = false
          + selector                          = {
              + "app" = "nginx"
            }
          + session_affinity                  = "ClientIP"
          + type                              = "LoadBalancer"

          + port {
              + node_port   = (known after apply)
              + port        = 8080
              + protocol    = "TCP"
              + target_port = "80"
            }

          + session_affinity_config {
              + client_ip {
                  + timeout_seconds = (known after apply)
                }
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @antonio-rufo, Action: `pull_request`*